<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"s3","backend":"c7c5227697a74d449604f4aa10f153072bcd01737d7df09d4fcf26f42b4e40a5","plan_job_ref":"Job Infrastructure #375 at https://github.com/coverage-robot/core/actions/runs/8161760677","plan_out_hash":"a1e1088997a8e9ca3edc253dd0b31c33da86b992da99355094866a59e47418e5","plan_hash":"af17feb3d21f420d7a01d84b8c2c891dbf07b984dfef26d85f12a3a8af789941","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __./infrastructure__ in the __prod__ workspace
With var files: `./infrastructure/prod.tfvars`<details open><summary>With variables</summary>

```hcl
planetscale_service_token    = (sensitive value)
planetscale_service_token_id = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.events.aws_iam_policy.coverage_event_scheduler_policy will be created
+   resource "aws_iam_policy" "coverage_event_scheduler_policy" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = "coverage-event-scheduler-policy-prod"
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "events:PutEvents",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           {
+                               arn               = "arn:aws:events:eu-west-2:952005856579:event-bus/coverage-events-prod"
+                               event_source_name = null
+                               id                = "coverage-events-prod"
+                               name              = "coverage-events-prod"
+                               tags              = {}
+                               tags_all          = {}
                            },
                        ]
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.events.aws_iam_role_policy_attachment.coverage_event_scheduler_policy_attachment will be created
+   resource "aws_iam_role_policy_attachment" "coverage_event_scheduler_policy_attachment" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "coverage-event-scheduler-role-prod"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
!~  upload_table              = {
        id                          = "projects/coverage-384615/datasets/prod/tables/upload"
!~      last_modified_time          = 1709662313394 -> 1709665913561
!~      num_bytes                   = 13959538 -> 13965505
!~      num_rows                    = 52428 -> 52452
#        (27 unchanged attributes hidden)
    }
```
</details>

:memo: Plan generated in [Infrastructure #375](https://github.com/coverage-robot/core/actions/runs/8161760677)